app/Logging/Handlers/DatabaseLogHandler.php

insert into "logs" ("level", "channel", "message", "context", "created_at", "updated_at") values ('INFO', 'database', 'Inicio de sesión exitoso', '{"extra":"OAAA"}', '2025-05-08 23:43:19', '2025-05-08 23:43:19')
---
    protected function write(array $record): void
    {
        DB::table('logs')->insert([
            'level' => $record['level_name'],
            'channel' => $record['channel'],
            'message' => $record['message'],
            'context' => json_encode($record['context']),
            'created_at' => now(),
            'updated_at' => now(),
        ]);