app/Http/Controllers/CategoriaController.php

     public function apiList(Request $request)
    {
        $categorias = Categoria::with('subcategorias')->get();
---
select * from "categorias"