app/Http/Controllers/SubcategoriaController.php

    public function index(Request $request)
    {
        session(['listado_url.subcategorias' => url()->full()]);
        $query = Subcategoria::with('categoria');

        if ($request->filled('nombre')) {
            $query->where('nombre', 'like', '%' . $request->nombre . '%');
        }

        if ($request->filled('categoria_id')) {
            $query->where('categoria_id', $request->categoria_id);
        }

        $subcategorias = $query->paginate(10)->withQueryString();
---
select * from "subcategorias"